import vk_api
from vk_api.bot_longpoll import VkBotLongPoll, VkBotEventType
from datetime import datetime , date
import calendar

token = "08e1dd015f60d5c33c2f4cda4905981f0889eee1d34cf007eed697a1323dc64e12ca8f3c8365b0a1641f3"

vk_session = vk_api.VkApi(token = token)
longpoll = VkBotLongPoll(vk_session, 199359389)

current_datetime = datetime.now()
time1 = str(current_datetime.hour) + ':' + str(current_datetime.minute)
print(time1)

my_date = date.today()
day1 = calendar.day_name[my_date.weekday()]

nums = int(datetime.utcnow().isocalendar()[1])
x = datetime.now()

k = 0

def sender(id, text):
    vk_session.method('messages.send', {'chat_id': id, "message": text, "random_id": 0})

id = 3
name = "@thenevor(.)@id120956346(.)@id82574142(.)@jojokir(.)@aiaiaiimyourlittlebutterfly(.)@fijiplayer(.)@evsenadinjo(.)@pfrolov20(.)@myguardianwithme(.)@id167848868(.)@dureman23 (.)@id404333201(.)@goddamndatisvadem(.)@id193373728(.)@tvojsutener(.)@bahus99(.)@r.sanya12(.)@i.golovin2001(.)@danila_chr(.)@id118566325(.)@stuffed_shirt(.)@nepomasti(.)@ibetadam99(.)@zlydenheh(.)@id458896500(.)@hevabat(.)@idaftt(.)........................................................."
while True:
    current_datetime = datetime.now()
    time1 = str(current_datetime.hour) + ':' + str(current_datetime.minute)
    #if day1 == 'Sunday':


    #Суббота!
    if day1 == 'Saturday':  
        if time1 == '9:25' and k == 0:
            sender(id, name + "\n ЦОС - Лекция через 5 минут(ДИСТАНЦИОННО)\nhttp://le2.callshark.ru/b/adm-zxh-6jv")
            k = 1
        if time1 == '9:26':
            k = 0
        if time1 == '11:15' and k == 0:
            sender(id, name + "\n ЦОС - Лекция через 5 минут(ДИСТАНЦИОННО)\nhttp://le2.callshark.ru/b/adm-zxh-6jv")
            k = 1
        if time1 == '11:16':
            k = 0
        if time1 == '13:5' and k == 0:
            sender(id, name + "\n Сетевые технологии - Лекция через 5 минут(ДИСТАНЦИОННО)")
            k = 1
        if time1 == '13:6':
            k = 0
    #Понедельник
    if day1 == 'Monday':
        if (nums % 2) != 0:
            if time1 == '11:15' and k == 0:
                sender(id, name + "\n Проводное вещание и оповещение - Практика через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '11:16':
                k = 0
            if time1 == '13:5' and k == 0:
                sender(id, name + "\n Проводное вещание и оповещение - Лекция через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '13:6':
                k = 0
            if time1 == '15:20' and k == 0:
                sender(id, name + "\n ФИЗРА - Практика через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '15:21':
                k = 0
        else:
            if time1 == '13:5' and k == 0:
                sender(id, name + "\n Проводное вещание и оповещение - Лекция через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '13:6':
                k = 0
            if time1 == '15:20' and k == 0:
                sender(id, name + "\n ФИЗРА - Практика через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '15:21':
                k = 0
            #if time1 == '17:10' and k == 0:
            #    sender(id, name + "\n Управление качеством связи - Практика через 5 минут(ДИСТАНЦИОННО)")
            #    k = 1
            #if time1 == '17:11':
            #    k = 0
    
    #Вторник
    if day1 == 'Tuesday':
        if (nums % 2) != 0:
            if time1 == '9:25' and k == 0:
                sender(id, name + "\n Управление качеством - Лекция через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '9:26':
                k = 0
            if time1 == '11:15' and k == 0:
                sender(id, name + "\n Основы криптографии - Лекция через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '11:16':
                k = 0
            if time1 == '13:5' and k == 0:
                sender(id, name + "\n Управление качеством связи - Практика через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '13:6':
                k = 0
            if time1 == '15:20' and k == 0:
                sender(id, name + "\n Основы криптографии - Практика через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '15:21':
                k = 0
            if time1 == '17:10' and k == 0:
                sender(id, name + "\n ЦОС - Лаба через 5 минут(ДИСТАНЦИОННО)\nhttp://le2.callshark.ru/b/adm-zxh-6jv")
                k = 1
            if time1 == '17:11':
                k = 0
        else:
            if time1 == '9:25' and k == 0:
                sender(id, name + "\n Управление качеством - Лекция через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '9:26':
                k = 0
            if time1 == '11:15' and k == 0:
                sender(id, name + "\n Основы криптографии - Лекция через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '11:16':
                k = 0
            if time1 == '13:5' and k == 0:
                sender(id, name + "\n Управление качеством связи - Лаба через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '13:6':
                k = 0
            if time1 == '15:20' and k == 0:
                sender(id, name + "\n Основы криптографии - Практика через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '15:21':
                k = 0
            if time1 == '17:10' and k == 0:
                sender(id, name + "\n ЦОС - Лаба через 5 минут(ДИСТАНЦИОННО)\nhttp://le2.callshark.ru/b/adm-zxh-6jv")
                k = 1
            if time1 == '17:11':
                k = 0
    #Среда
    if day1 == 'Wednesday':
        if (nums % 2) != 0:
            if time1 == '9:25' and k == 0:
                sender(id, name + "\n ОКиТПЭС - Лекция через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '9:26':
                k = 0
            if time1 == '11:15' and k == 0:
                sender(id, name + "\n Сетевые технологии - Лекция через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '11:16':
                k = 0
            if time1 == '13:5' and k == 0:
                sender(id, name + "\n ИСиС - Лекция через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '13:6':
                k = 0
            if time1 == '15:20' and k == 0:
                sender(id, name + "\n ЦОС - Лекция через 5 минут(ДИСТАНЦИОННО)\nhttp://le2.callshark.ru/b/adm-zxh-6jv")
                k = 1
            if time1 == '15:21':
                k = 0
            if time1 == '17:10' and k == 0:
                sender(id, name + "\n Основы криптографии - Лаба через 5 минут(ОЧН0 АУДИТОРИЯ 402)")
                k = 1
            if time1 == '17:11':
                k = 0
        else:
            if time1 == '9:25' and k == 0:
                sender(id, name + "\n ЦОС - Лаба через 5 минут(ДИСТАНЦИОННО)\nhttp://le2.callshark.ru/b/adm-zxh-6jv")
                k = 1
            if time1 == '9:26':
                k = 0
            if time1 == '11:15' and k == 0:
                sender(id, name + "\n Сетевые технологии - Лекция через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '11:16':
                k = 0
            if time1 == '13:5' and k == 0:
                sender(id, name + "\n ИСиС - Лекция через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '13:6':
                k = 0
            if time1 == '15:20' and k == 0:
                sender(id, name + "\n Python-Прогр - Лекция через 5 минут(ДИСТАНЦИОННО)")
                k = 1
            if time1 == '15:21':
                k = 0
            if time1 == '17:10' and k == 0:
                sender(id, name + "\n Основы криптографии - Лаба через 5 минут(ОЧН0 АУДИТОРИЯ 402)")
                k = 1
            if time1 == '17:11':
                k = 0

    messagelist = longpoll.check()
    if messagelist:
        msg = messagelist[0].object.message['text'].lower()

        if msg == 'понедельник':
                a = ('Верхняя неделя\n---------------------------------------------------------------------\nВремя - 11: 20 - Практика - Проводное вещание и оповещение(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 13: 10 - Лекция - Проводное вещание и оповещение(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 15: 25 - Практика - ФИЗРА(ДИСТАНЦИОННО)\n---------------------------------------------------------------------')
                sender(id, a + '\n\nНижняя неделя\n---------------------------------------------------------------------\nВремя - 13: 10 - Лекция - Проводное вещание и оповещение(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 15: 25 - Практика - ФИЗРА(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 17: 15 - Практика - Управление качеством связи(ДИСТАНЦИОННО - ТОЛЬКО С 12 НЕДЕЛИ ПО 16)')
        if msg == 'вторник':
                a = ('Верхняя неделя\n---------------------------------------------------------------------\nВремя - 9: 30 - Лекция - Управление качеством(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 11: 20 - Лекция - Основы криптографии(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 13: 10 - Практика Управление качеством связи(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 15: 25 - Практика - Основы криптографии(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 17: 15 - Лаба - ЦОС(ДИСТАНЦИОННО)')
                sender(id, a + '\n\nНижняя неделя\n---------------------------------------------------------------------\nВремя - 9: 30 - Лекция - Управление качеством(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 11: 20 - Лекция - Основы криптографии(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 13: 10 - Лаба Управление качеством связи(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 15: 25 - Практика - Основы криптографии(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 17: 15 - Лаба - ЦОС(ДИСТАНЦИОННО)')
        if msg == 'среда':
                a = ('Верхняя неделя\n---------------------------------------------------------------------\nВремя - 9: 30 - Лекция - ОКиТПЭС(АУДИТОРИЯ А-502)\n---------------------------------------------------------------------\nВремя - 11: 20 - Лекция - Сетевые технологии(АУДИТОРИЯ А-502)\n---------------------------------------------------------------------\nВремя - 13: 10 - Лекция ИСиС(АУДИТОРИЯ А-502)\n---------------------------------------------------------------------\nВремя - 17: 15 - Лаба - Основы криптографии(АУДИТОРИЯ 402(ТОЛЬКО С 13 НЕДЕЛИ))')
                sender(id, a + '\n\nНижняя неделя\n---------------------------------------------------------------------\nВремя - 9: 30 - Лаба - ЦОС(НА 17 НЕДЕЛИ)\n---------------------------------------------------------------------\nВремя - 11: 20 - Лекция - Сетевые технологии(АУДИТОРИЯ А-502)\n---------------------------------------------------------------------\nВремя - 13: 10 - Лекция ИСиС(АУДИТОРИЯ А-502)\n---------------------------------------------------------------------\nВремя - 15: 25 - Лекция - Python-программирование(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 17: 15 - Лаба - Основы криптографии(АУДИТОРИЯ 402(ТОЛЬКО С 13 НЕДЕЛИ))')
        if msg == 'четверг':
                a = ('Верхняя неделя\n---------------------------------------------------------------------\nВремя - 9: 30 - Практика - ИСиС(АУДИТОРИЯ A-163)\n---------------------------------------------------------------------\nВремя - 11: 20 - Лаба - ИСиС(АУДИТОРИЯ Л-103))\n---------------------------------------------------------------------\nВремя - 13: 10 - Практика - ФИЗРА(ОЧНО)\n---------------------------------------------------------------------\nВремя - 15: 25 - Лаба - ЦОС(АУДИТОРИЯ УЛК-1010(С 10-18 НЕДЕЛЮ))\n---------------------------------------------------------------------\nВремя - 17: 15 - Лаба - ЦОС(АУДИТОРИЯ УЛК-1010(С 16-17 НЕДЕЛЮ))')
                sender(id, a + '\n\nНижняя неделя\n---------------------------------------------------------------------\nВремя - 9: 30 - Практика - ИСиС(АУДИТОРИЯ A-163)\n---------------------------------------------------------------------\nВремя - 11: 20 - Лаба - ИСиС(АУДИТОРИЯ Л-103))\n---------------------------------------------------------------------\nВремя - 13: 10 - Практика - ФИЗРА(ОЧНО)\n---------------------------------------------------------------------\nВремя - 15: 25 - Лаба - ЦОС(АУДИТОРИЯ УЛК-1010(С 10-18 НЕДЕЛЮ))\n---------------------------------------------------------------------\nВремя - 17: 15 - Лаба - ЦОС(АУДИТОРИЯ УЛК-1010(С 16-17 НЕДЕЛЮ))')
        if msg == 'пятница':
                a = ('Верхняя неделя\n---------------------------------------------------------------------\nВремя - 11: 20 - Лаба - Сетевые технологии(АУДИТОРИЯ Л-413(С 13-18 НЕДЕЛЮ)))\n---------------------------------------------------------------------\nВремя - 13: 10 - Лаба - Сетевые технологии(АУДИТОРИЯ Л-413(С 13-18 НЕДЕЛЮ))\n---------------------------------------------------------------------\nВремя - 15: 25 - Практика - ОКиТПЭС(АУДИТОРИЯ Л-511)\n---------------------------------------------------------------------\nВремя - 17: 15 - Практика - Python-программирование(АУДИТОРИЯ А-300)')
                sender(id, a + '\n\nНижняя неделя\n---------------------------------------------------------------------\nВремя - 11: 20 - Лаба - Сетевые технологии(АУДИТОРИЯ Л-413(с 13-18 НЕДЕЛЮ)))\n---------------------------------------------------------------------\nВремя - 13: 10 - Лаба - Сетевые технологии(АУДИТОРИЯ Л-413(С 13-18 НЕДЕЛЮ))\n---------------------------------------------------------------------\nВремя - 15: 25 - Лаба - ОКиТПЭС(АУДИТОРИЯ Л-511(С 10-16 НЕДЕЛЮ))\n---------------------------------------------------------------------\nВремя - 17: 15 - Лаба - Python-программирование(АУДИТОРИЯ А-300)')
        if msg == 'суббота':
                a = ('Верхняя неделя\n---------------------------------------------------------------------\nВремя - 9: 30 - Лекция - ЦОС(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 11: 20 - Лекция - ЦОС(ДИСТАНЦИОННО))\n---------------------------------------------------------------------\nВремя - 13: 10 - Лекция - Сетевые технологии(ДИСТАНЦИОННО)')
                sender(id, a + '\n\nНижняя неделя\n---------------------------------------------------------------------\nВремя - 9: 30 - Лекция - ЦОС(ДИСТАНЦИОННО)\n---------------------------------------------------------------------\nВремя - 11: 20 - Лекция - ЦОС(ДИСТАНЦИОННО))\n---------------------------------------------------------------------\nВремя - 13: 10 - Лекция - Сетевые технологии(ДИСТАНЦИОННО)')
        if msg == 'неделя':
            if (nums % 2) != 0:
                sender(id, str(nums-34) + ' верхняя(нечетная)')
            else: sender(id, str(nums-34) + ' нижняя(четная)')
        if msg == 'команды':
            sender(id, 'Неделя - информация о текущей учебной неделе\n Преподы - вся инфа о преподах\n Деканат - почта и телефон деканата СиСС\nДиск - диск, на котором хранятся всякие вкусности\nДискорд - бот скидывает ссылку на канал дискорда нашей группы\n\nЕсли написать день недели, то вы получите расписание на этот день уже с учетом четности недели')
        if msg == 'преподы':
            sender(id, 'Степанов Михаил Сергеевич - m.s.stepanov@mtuci.ru\n Шишова Надежда Альвиновна - n.a.shishova@mtuci.ru\n Волчков Валерий Павлович\n')
        if msg == 'диск':
            sender(id, 'https://drive.google.com/drive/folders/19W93cJFX3UxDoBcQoG-_VYOb4QqLekGb')
        if msg == 'деканат':
            sender(id, '+7 (495) 957-79-22')
        if msg == 'воскресенье':
            sender(id, 'В воскресенье адыхаем)')
        if msg == 'дискорд':
            sender(id, 'Дискорд нашей группы\nhttps://discord.gg/4MGt7U6Pdf')
